"""
Напишите программу, которая получает целое число и 
возвращает его шестнадцатеричное строковое представление. 
Функцию hex используйте для проверки своего результата.
"""
BASE = 2
 
number = int(input('Введите число: '))
print(number, 'in hex =', hex(number))


